### Load i-python SQL

In [1]:
%load_ext sql

### Connect to postgreSQL

In [2]:
%sql postgresql+psycopg2://alexandergelernter:password123@localhost:5432/intro_to_sql_for_analytics

## Exercise 1

Temu wanted to write a query that generates a table showing the number of athletes and gold medals for each country. The following is their attempt.

In [3]:
%%sql

SELECT medals_sub.country, medals_sub.medals, athletes_sub.athletes 
FROM (
    SELECT COUNT(*) as gold_medals, country
    FROM medals
    WHERE medal='Gold Medal'
    GROUP BY country
) medals_sub
INNER JOIN (
    SELECT COUNT(*) as athletes, countrycode FROM athletes GROUP BY countrycode
) athletes_sub
ON medals_sub.country = athletes_sub.countrycode;

 * postgresql+psycopg2://alexandergelernter:***@localhost:5432/intro_to_sql_for_analytics
(psycopg2.errors.UndefinedColumn) column medals_sub.medals does not exist
LINE 1: SELECT medals_sub.country, medals_sub.medals, athletes_sub.a...
                                   ^

[SQL: SELECT medals_sub.country, medals_sub.medals, athletes_sub.athletes FROM (
    SELECT COUNT(*) as gold_medals, country
    FROM medals
    WHERE medal='Gold Medal'
    GROUP BY country
) medals_sub
INNER JOIN (
    SELECT COUNT(*) as athletes, countrycode FROM athletes GROUP BY countrycode
) athletes_sub
ON medals_sub.country = athletes_sub.countrycode;]
(Background on this error at: http://sqlalche.me/e/14/f405)

From the error, we have an obvious fix of the mistitled medals column. (Should be gold_medals) But I want to work my way up trhough the logic before addressing things like this.

Maybe I wouldn't do this in the real world, but because I can be sure there are multiple errors in this exercise, it feels more efficient...

First we pull out the FROM subquery and check that it works. LIMIT 5 for readability of entire notebook.

In [6]:
%%sql

SELECT COUNT(*) as gold_medals, country
FROM medals
WHERE medal='Gold Medal'
GROUP BY country
LIMIT 5;

 * postgresql+psycopg2://alexandergelernter:***@localhost:5432/intro_to_sql_for_analytics
5 rows affected.

[(127, "People's Republic of China"),
 (4, 'Indonesia'),
 (19, 'Italy'),
 (3, 'Venezuela'),
 (2, 'Czech Republic')]

Not how I would do it, but looks operable.

Now the JOIN subquery:

In [8]:
%%sql

SELECT COUNT(*) as athletes, countrycode 
FROM athletes 
GROUP BY countrycode
LIMIT 5;

 * postgresql+psycopg2://alexandergelernter:***@localhost:5432/intro_to_sql_for_analytics
5 rows affected.

[(25, 'DEN'), (74, 'NED'), (12, 'UAE'), (1, 'CAM'), (2, 'NCA')]

This works, but I have a sneaking suspicion we'll want to change this to country rather than countrycode to make the merge function.

Looking at the original query one more time...

In [ ]:
%%sql

SELECT medals_sub.country, medals_sub.medals, athletes_sub.athletes 
FROM (
    SELECT COUNT(*) as gold_medals, country
    FROM medals
    WHERE medal='Gold Medal'
    GROUP BY country
) medals_sub
INNER JOIN (
    SELECT COUNT(*) as athletes, countrycode FROM athletes GROUP BY countrycode
) athletes_sub
ON medals_sub.country = athletes_sub.countrycode;

and writing the fixed version:

In [16]:
%%sql

SELECT medals_sub.country, medals_sub.gold_medals, athletes_sub.athletes 
FROM (
    SELECT COUNT(*) as gold_medals, country
    FROM medals
    WHERE medal='Gold Medal'
    GROUP BY country
) medals_sub
INNER JOIN (
    SELECT COUNT(*) as athletes, country FROM athletes GROUP BY country
) athletes_sub
ON medals_sub.country = athletes_sub.country
ORDER BY medals_sub.gold_medals DESC, athletes_sub.athletes DESC
LIMIT 10;

 * postgresql+psycopg2://alexandergelernter:***@localhost:5432/intro_to_sql_for_analytics
10 rows affected.

[("People's Republic of China", 127, 256),
 ('United States of America', 65, 243),
 ('Great Britain', 64, 221),
 ('RPC', 49, 248),
 ('Netherlands', 38, 74),
 ('Brazil', 36, 241),
 ('Australia', 24, 181),
 ('Ukraine', 24, 139),
 ('Islamic Republic of Iran', 23, 63),
 ('Italy', 19, 114)]

# Challenge

Paula wanted to write a query that generates a table showing the average age of competitors winning each medal - gold, silver or bronze. Her query is below:

In [17]:
%%sql

SELECT subquery_result.medal, SUM(subquery_result.age) as average_age
FROM (
    SELECT
        medals.medal,
        DATE_PART('year', CURRENT_DATE) - DATE_PART('year', athletes.date_of_birth) as age
    FROM athletes 
    INNER JOIN medals
    ON athletes.name = medals.name
) subquery_result
GROUP BY medal;

 * postgresql+psycopg2://alexandergelernter:***@localhost:5432/intro_to_sql_for_analytics
3 rows affected.

[('Silver Medal', 23582.0), ('Gold Medal', 23247.0), ('Bronze Medal', 25988.0)]

Ran the query just to see what we get. Those are some OLD competitors. No basic errors, but we're obviously not getting what we want. Logically we will need all ages per medal type, so we can average them together and display.

Calling SUM on average age seems really silly. And our numbers would be too large with that error. Let's swap it.

In [22]:
%%sql

SELECT subquery_result.medal, AVG(subquery_result.age) as average_age
FROM (
    SELECT
        medals.medal,
        DATE_PART('year', CURRENT_DATE) - DATE_PART('year', athletes.date_of_birth) as age
    FROM athletes 
    INNER JOIN medals
    ON athletes.name = medals.name
) subquery_result
GROUP BY medal;

 * postgresql+psycopg2://alexandergelernter:***@localhost:5432/intro_to_sql_for_analytics
3 rows affected.

[('Silver Medal', 32.79833101529903),
 ('Gold Medal', 31.88888888888889),
 ('Bronze Medal', 33.105732484076434)]

This seems correct but that was... simple. I feel I must be missing something here. I'll at least check the subquery for sanity's sake.

In [24]:
%%sql

SELECT
    medals.medal,
    DATE_PART('year', CURRENT_DATE) - DATE_PART('year', athletes.date_of_birth) as age
FROM athletes 
INNER JOIN medals
ON athletes.name = medals.name
LIMIT 5;

 * postgresql+psycopg2://alexandergelernter:***@localhost:5432/intro_to_sql_for_analytics
5 rows affected.

[('Silver Medal', 39.0),
 ('Silver Medal', 39.0),
 ('Gold Medal', 39.0),
 ('Bronze Medal', 26.0),
 ('Bronze Medal', 43.0)]

Yup, that seems fine. Cool. Let's just re-post our working query. I think I'll add FLOOR for presentation, since people don't often discuss ages as fractions.

In [25]:
%%sql

SELECT subquery_result.medal, FLOOR(AVG(subquery_result.age)) as average_age
FROM (
    SELECT
        medals.medal,
        DATE_PART('year', CURRENT_DATE) - DATE_PART('year', athletes.date_of_birth) as age
    FROM athletes 
    INNER JOIN medals
    ON athletes.name = medals.name
) subquery_result
GROUP BY medal;

 * postgresql+psycopg2://alexandergelernter:***@localhost:5432/intro_to_sql_for_analytics
3 rows affected.

[('Silver Medal', 32.0), ('Gold Medal', 31.0), ('Bronze Medal', 33.0)]